### Investigating DataSet is come from kaggle website

[House Pricing in Tunisia data-set (25 features)](https://www.kaggle.com/datasets/samermakni/tunisia-house-pricing)

In [4]:
import numpy as np
import pandas as pd
import matplotlib as plot

In [2]:
# pip install zipfile

In [5]:
from zipfile import ZipFile

In [6]:
with ZipFile('archive.zip', 'r') as file:
    file.extractall()

After extraction, faced two dataset, **dataset_clean.csv** and **dataSetFull.csv**.
In this analysis notebook, just using raw file, dataSetFull.csv.

In [7]:
df0  = pd.read_csv('dataSetFull.csv')

In [8]:
df = df0.copy()

In [9]:
df.head()

,id,price_tnd,price_eur,location,city,governorate,Area,pieces,room,bathroom,...,garden,concierge,beach_view,mountain_view,pool,elevator,furnished,equipped_kitchen,central_heating,air_conditioning
0,b9e1c759-d149-46e8-9765-d8c198a13ff0,NaN,NaN,Cité El Bassatine Ancien,Boumhel Bassatine,Ben Arous,NaN,27.0,8.0,NaN,...,0,0,0,0,0,0,0,0,0,0
1,863e62e5-0bfe-49f3-ad97-e0ae91be68e9,3250000.0,1007500.0,El Kantaoui,Hammam Sousse,Sousse,1000.0,26.0,16.0,14.0,...,0,1,1,0,0,1,1,1,1,1
2,0048e6da-9aec-4ebe-8ee1-1ad7cd0015e6,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,10.0,...,0,0,0,0,0,0,1,1,1,1
3,032f818f-1b38-4d1a-a000-753e235ccf54,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,NaN,...,0,0,0,0,0,0,1,1,1,1
4,2272576f-fb3b-4c82-8a0e-a00fe2e7c154,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,10.0,...,0,0,0,0,0,0,1,1,1,1

This dataset has been gathered in October 2022 by scraping "various" house sales websites. 

It has no house type like that house, apartment, villa, and etc.

Dataset has more than 8000 observations with  25 features, named like that

- **``id``** 128-bit universally unique identifier.


### Price Features

- **``price_tnd``** the price of in Tunisian Dinars (changes between 350,000  and 457,000; 1708 NaNs)

- **``price_eur``** the price of in Tunisian Euros. (changes between 108,500 and 141,670; 1708 NaNs)


( **Not raw feature** converted on 29 October 2022 with a conversion rate of 1 TND equals 0.31 euros.)

### Location Feature

- **``location``** the neighborhood of location (takes 468 different environment)

- **``city``** the city of location (takes 70 cities, 1316 NaNs)

- **``governorate``** the governorate of location (takes 22 governorates and a islands, official 24)
   
( Djerba Island is situated on governorate Medenine. There is not seen house any on Sidi Bouzid and Tozeur governorate)
     

> term categorizes like  location > city > govornorate 


- **``latt``** the latitude of location  (35 NaNs)

- **``long``**  the longitude locatio (35 NaNs)

-  **``distance_to_ capital``** the distance from the capital of Tunisia, Tunis ( **Not raw feature**

### House Attribute Feautures
- **``Area``** the area of in square meters (takes between 20 and 22,000,  185 NaNs)

- **``pieces``** the total number of rooms and saloons (takes between 1 and 27, 1189 NaNs)

> can be found the number of saloons 

- **``room``** the number of rooms (takes between 1 and 50,  409 NaNs)
- **``age``** the age of  house  (takes 1 number -0 means it is new-  and 9 intervals, 4145 NaNs)
- **``state``** the status of house (takes brand new 0, normal state 1, renovation 2 ;    1100 NaNs)
- **``bathroom``**  the number of bathrooms (takes between 1 and 20;   659 NaNs)
- **``garage``** whether has a garage or not (takes No 0,  Yes 1)
- **``garden``** whether has a garden or not (takes No 0,  Yes 1)
- **``concierge``** whether has a concierge or not (takes No 0,  Yes 1)
- **``beach_view``** whether has a beach view or not (takes No 0,  Yes 1)
- **``mountain_view``** whether has a mountain view or not (takes No 0,  Yes 1)
- **``pool``** whether is a pool or not (takes No 0,  Yes 1)
- **``elevator``** whether is an elevator or not (takes No 0,  Yes 1)
- **``furnished``** whether is furnished or not (takes No 0,  Yes 1)
- **``equipped_kitech``** whether kitchen is equipped or not (takes No 0,  Yes 1)
- **``central_heating``** whether has central heating or not (takes No 0,  Yes 1)
- **``air_conditionting``** whether has air-condition or not (takes No 0,  Yes 1))  unnecessaryline) air conditioning or not. not.

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8129 entries, 0 to 8128
Data columns (total 26 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   8129 non-null   object
 1   price_tnd            6421 non-null   float64
 2   price_eur            6421 non-null   float64
 3   location             8129 non-null   object
 4   city                 6813 non-null   object
 5   governorate          8129 non-null   object
 6   Area                 7944 non-null   float64
 7   pieces               6940 non-null   float64
 8   room                 7720 non-null   float64
 9   bathroom             7470 non-null   float64
 10  age                  3984 non-null   object
 11  state                7029 non-null   float64
 12  latt                 8094 non-null   float64
 13  long                 8094 non-null   float64
 14  distance_to_capital  8094 non-null   float64
 15  garage               8129 non-null   int64
 16  garden               8129 non-null   int64
 17  concierge            8129 non-null   int64
 18  beach_view           8129 non-null   int64
 19  mountain_view        8129 non-null   int64
 20  pool                 8129 non-null   int64
 21  elevator             8129 non-null   int64
 22  furnished            8129 non-null   int64
 23  equipped_kitchen     8129 non-null   int64
 24  central_heating      8129 non-null   int64
 25  air_conditioning     8129 non-null   int64
dtypes: float64(10), int64(11), object(5)
memory usage: 1.6+ MB

In [8]:
df.pieces.describe()

count    6940.000000
mean        4.318300
std         2.270759
min         1.000000
25%         3.000000
50%         4.000000
75%         5.000000
max        27.000000
Name: pieces, dtype: float64

In [9]:
df.room.describe()

count    7720.000000
mean        3.325389
std         2.020898
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max        50.000000
Name: room, dtype: float64

In [10]:
df[(df['room'] > 20) & (df['pieces'] > 20)]

,id,price_tnd,price_eur,location,city,governorate,Area,pieces,room,bathroom,...,garden,concierge,beach_view,mountain_view,pool,elevator,furnished,equipped_kitchen,central_heating,air_conditioning
2,0048e6da-9aec-4ebe-8ee1-1ad7cd0015e6,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,10.0,...,0,0,0,0,0,0,1,1,1,1
3,032f818f-1b38-4d1a-a000-753e235ccf54,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,NaN,...,0,0,0,0,0,0,1,1,1,1
4,2272576f-fb3b-4c82-8a0e-a00fe2e7c154,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,10.0,...,0,0,0,0,0,0,1,1,1,1

In [11]:
df[df['room'] > 25]

,id,price_tnd,price_eur,location,city,governorate,Area,pieces,room,bathroom,...,garden,concierge,beach_view,mountain_view,pool,elevator,furnished,equipped_kitchen,central_heating,air_conditioning
255,0e6bc10c-8bc8-416a-9733-4431b96dc055,NaN,NaN,Nabeul,Nabeul,Nabeul,900.0,9.0,50.0,3.0,...,0,0,1,0,1,0,1,1,1,1
6984,28b61cbb-6515-4cf8-a07a-451f25666087,2300000.0,713000.0,Sahloul,Sousse Ville,Sousse,1200.0,NaN,42.0,12.0,...,0,0,0,0,0,0,0,0,0,0

In [12]:
((df['pieces'].isnull()) & (df['room'].isnull() )).sum()

362

In [13]:
pd.Categorical(df['city'])

['Boumhel Bassatine', 'Hammam Sousse', 'Sousse Ville', 'Sousse Ville', 'Sousse Ville', ..., 'Sousse Ville', 'Hammam Sousse', 'Carthage', NaN, 'La Marsa']
Length: 8129
Categories (70, object): ['Ajim', 'Akouda', 'Ariana Ville', 'Ben Arous', ..., 'Sousse Ville', 'Tabarka', 'Tebourba', 'Tunis']

## How to imputate NaN of city, distance_to_capital, latt, long, beach_view and mountain_view column data

In [14]:
df.isnull().sum()

id                        0
price_tnd              1708
price_eur              1708
location                  0
city                   1316
governorate               0
Area                    185
pieces                 1189
room                    409
bathroom                659
age                    4145
state                  1100
latt                     35
long                     35
distance_to_capital      35
garage                    0
garden                    0
concierge                 0
beach_view                0
mountain_view             0
pool                      0
elevator                  0
furnished                 0
equipped_kitchen          0
central_heating           0
air_conditioning          0
dtype: int64

In [15]:
(df.latt.isnull() & df.long.isnull()).sum()

35

In [16]:
(df.latt.isnull() & df.long.isnull() &  df.city.isnull()).sum()

1

In [17]:
(df.latt.isnull() & df.long.isnull() &  df.city.isnull()).sum()

1

In [18]:
df.columns.value_counts()

id                     1
price_tnd              1
central_heating        1
equipped_kitchen       1
furnished              1
elevator               1
pool                   1
mountain_view          1
beach_view             1
concierge              1
garden                 1
garage                 1
distance_to_capital    1
long                   1
latt                   1
state                  1
age                    1
bathroom               1
room                   1
pieces                 1
Area                   1
governorate            1
city                   1
location               1
price_eur              1
air_conditioning       1
Name: count, dtype: int64

In [19]:
df.governorate.value_counts()

governorate
tunis           2303
Nabeul          1884
Ariana          1440
Ben Arous        721
 Sousse          670
Djerba           384
Bizerte          224
La Manouba        96
Monastir          96
Mahdia            64
Sfax              64
Kébili            30
Gabès             30
Kairouan          22
Béja              20
Zaghouan          20
Medenine          18
Jendouba          16
Tataouine          9
Siliana            9
Gafsa              7
Le Kef             1
El Kasserine       1
Name: count, dtype: int64

In [20]:
df[df.governorate == 'Djerba'][['location', 'city', 'latt', 'long', 'distance_to_capital','governorate', 'state', 'age']]

,location,city,latt,long,distance_to_capital,governorate,state,age
7,Midoun,NaN,33.866667,10.850000,329.885067,Djerba,NaN,NaN
19,Tezdaine,NaN,33.803966,11.040065,341.757988,Djerba,1.0,5-10
23,Midoun,NaN,33.866667,10.850000,329.885067,Djerba,NaN,NaN
24,Aghir,NaN,33.759722,11.012510,345.586423,Djerba,2.0,1-5
25,Midoun,NaN,33.866667,10.850000,329.885067,Djerba,NaN,NaN
...,...,...,...,...,...,...,...,...
7721,Djerba,Djerba,33.812323,10.986875,339.300057,Djerba,2.0,0
7927,Djerba,Djerba,33.809309,10.991402,339.748478,Djerba,2.0,0
8084,Houmt Souk,Djerba,33.866667,10.850000,329.885067,Djerba,NaN,NaN
8093,Djerba,NaN,33.807598,10.845147,336.063533,Djerba,NaN,NaN
8111,Djerba,Djerba,33.807598,10.845147,336.063533,Djerba,1.0,NaN

In [21]:
df[ ( (df['city'] == 'Djerba') & (df['long'] == '10.845147'))].value_counts()

Series([], Name: count, dtype: int64)

In [22]:
( (df['governorate'] == 'Djerba') & (df['long'] == '10.845147')).value_counts()

False    8129
Name: count, dtype: int64

In [23]:
df[df.governorate == 'Djerba'].long.value_counts()

long
10.845147    115
10.850000     84
11.040065     18
11.012510      8
10.987461      7
            ...
10.970506      1
11.002620      1
10.986866      1
10.990184      1
10.992690      1
Name: count, Length: 135, dtype: int64

In [24]:
df[df.governorate == 'Djerba'].long.unique()

array([10.85      , 11.0400653 , 11.01251   , 10.8451467 , 10.99013965,
       10.98696505, 10.99030918, 11.02670498, 10.7591506 , 11.0027267 ,
       10.98698191, 10.99018809, 10.85284121, 11.0143996 , 10.9673696 ,
       10.99012709, 10.987461  , 10.98586015, 10.85443383, 10.98686588,
       10.99024348, 10.99140219, 10.99322329, 11.0125    , 10.83210044,
       10.98703684, 10.8618954 , 10.8149652 , 10.98706724, 10.981542  ,
       10.9871651 , 10.85976445, 10.81431867, 10.85390143, 10.98700834,
       10.98696046, 10.98676262, 11.03628875, 10.98696061, 11.03946828,
       10.8473675 , 10.99018447, 10.98686578, 11.00261996, 10.97050629,
       10.96810303, 11.02756395, 10.98707065, 11.00634375, 11.00925498,
       10.96878967, 10.963889  , 11.00106201, 10.98698036, 10.99243216,
       10.82660727, 10.98673668, 10.98682876, 10.86529588, 10.98702483,
       10.98690091, 10.98722324, 10.98678879, 10.98705399, 10.99277548,
       10.98685218, 10.98691872, 10.98685519, 10.98706684, 10.986939  ,
       10.99350891, 10.99037222, 10.98687462, 10.98706636, 10.987041  ,
       10.98688658, 11.04569397, 10.98692218, 10.98690669, 10.98685317,
       10.98666005, 10.99105887, 10.88806204, 11.00724182, 11.00873345,
       10.8046814 , 11.0356021 , 11.02282009, 10.9890673 , 10.9524441 ,
       11.040065  , 10.98949268, 11.03264771, 10.98350577, 10.84279022,
       10.98853045, 11.00856833, 10.86589738, 10.8717295 , 10.98706774,
       10.8647161 , 10.98704629, 10.98697615, 11.00943366, 10.75841296,
        9.5375    , 10.99174552, 10.85956626, 10.99174552, 10.98696048,
       10.98702483, 10.98693252, 10.98642615, 10.99311881, 10.98699462,
       10.98705119, 11.03663207, 10.9900289 , 10.98698092, 10.9870613 ,
       10.99749668, 10.99213562, 10.800556  , 10.97595267, 10.98717618,
       10.98696455, 10.98699387, 10.98973236, 10.99246998, 10.997582  ,
       10.86429716, 10.98698578, 10.98691754, 10.86574607, 10.99268965])

In [25]:
df[df.governorate == 'Djerba'].latt.value_counts()

latt
33.807598    115
33.866667     84
33.803966     18
33.759722      9
33.811585      7
            ...
33.819425      1
33.812326      1
33.809201      1
33.883970      1
33.812323      1
Name: count, Length: 135, dtype: int64

## How to imputate NaN of age and state column data

In [62]:
len(df)

8129

In [26]:
df.age.value_counts(dropna = False)

age
NaN             4145
0               1471
1-5              826
5-10             671
10-20            557
20-30            193
10,20            124
30-50            104
50-70             22
Plus de 100        9
70-100             7
Name: count, dtype: int64

#### **age** the age of in intervals (takes 1 number and 9 intervals, 4145 NaNs)

```
0 (0 means it is new)
1-5
5-10
10-20
10,20 (comma will be fixxed, turned to '-')
20-30
30-50
50-70
70-100
Plus de 100
```

In [27]:
df.age.unique()

array([nan, '30-50 ', '1-5 ', '0', '5-10 ', '10-20 ', '20-30 ', '70-100 ',
       '10,20', 'Plus de 100 ', '50-70 '], dtype=object)

In [10]:
df.age.replace(to_replace = ['1-5 '], value = '1-5', inplace = True)
df.age.replace(to_replace = ['5-10 '], value = '5-10', inplace = True)
df.age.replace(to_replace = ['10,20'], value = '10-20', inplace = True)
df.age.replace(to_replace = ['10-20 '], value ='10-20', inplace = True)
df.age.replace(to_replace = ['20-30 '], value ='20-30', inplace = True)
df.age.replace(to_replace = ['30-50 '], value ='30-50', inplace = True)
df.age.replace(to_replace = ['50-70 '], value ='50-70', inplace = True)
df.age.replace(to_replace = ['70-100 '], value ='70-100', inplace = True)
df.age.replace(to_replace = ['Plus de 100 '], value ='Plus de 100', inplace = True)

#### updating **age** feature (takes 1 number and 8 intervals, 4145 NaNs)

```
0 (0 means it is new)
1-5
5-10
10-20
20-30
30-50
50-70
70-100
Plus de 100
```

In [29]:
df.age.unique()

array([nan, '30-50', '1-5', '0', '5-10', '10-20', '20-30', '70-100',
       'Plus de 100', '50-70'], dtype=object)

In [30]:
df.age.value_counts(dropna = False)

age
NaN            4145
0              1471
1-5             826
10-20           681
5-10            671
20-30           193
30-50           104
50-70            22
Plus de 100       9
70-100            7
Name: count, dtype: int64

In [31]:
df.state.value_counts(dropna = False, sort = False)

state
NaN    1100
1.0    3660
2.0    3044
0.0     325
Name: count, dtype: int64

#### **state** the status of the house (takes brand new 0.0, normal 1.0, renovation 2.0, 1100 NaNs)

### Hypothesis 1.  if age = '0', possible state = 0.0 (That means all new built house is brand new )

In [32]:
( (df['age'] == str(0)) & (df['state'] == 0.0) ).sum()

9

In [33]:
df[ (df['age'] == str(0)) & (df['state'] == 0.0) ] [['location', 'city', 'governorate', 'state', 'age']]

            location       city governorate  state age
873         Gammarth   La Marsa       tunis    0.0   0
1514  Mutuelle Ville  El Menzah       tunis    0.0   0
2123   Hammamet Nord   Hammamet      Nabeul    0.0   0
2733        Hammamet   Hammamet      Nabeul    0.0   0
4477   Hammamet Nord   Hammamet      Nabeul    0.0   0
5295          Mnihla     Mnihla      Ariana    0.0   0
5484          Djerba     Djerba      Djerba    0.0   0
5859          Hergla        NaN      Sousse    0.0   0
7048      El Manar 2  El Menzah       tunis    0.0   0

In [34]:
( (df['age'] == str(0)) & (df['state'] != 0.0) ).sum()

1462

In [35]:
( (df['age'] == str(0)) & (df['state'] != 0.0) ).sum()

1462

In [36]:
( (df['age'] == str(0)) & (df['state'] == 1.0) ).sum()

142

In [37]:
( (df['age'] == str(0)) & (df['state'] == 2.0) ).sum()

1319

In [38]:
df.loc[ df['age'] == str(0), ['location', 'city', 'governorate', 'state', 'age']]
# df.loc[ df['age'] == str(0)][['age', 'state']]

               location          city governorate  state age
9              Le Bardo      Le Bardo       tunis    2.0   0
14              Rejiche           NaN      Mahdia    2.0   0
17             Le Bardo      Le Bardo       tunis    2.0   0
21    Riadh al Andalous  Ariana Ville      Ariana    2.0   0
33        Hammamet Nord      Hammamet      Nabeul    2.0   0
...                 ...           ...         ...    ...  ..
8120            Sahloul  Sousse Ville      Sousse    2.0   0
8121            Sahloul  Sousse Ville      Sousse    2.0   0
8122            Sahloul  Sousse Ville      Sousse    2.0   0
8123            Sahloul  Sousse Ville      Sousse    2.0   0
8124            Sahloul  Sousse Ville      Sousse    2.0   0

[1471 rows x 5 columns]

In [39]:
((df['age'] == str(0)) &  (df['state'].isnull())).sum()

1

In [40]:
df.loc[(df['age'] == str(0)) & (df['state'].isnull()), ['location', 'city', 'governorate', 'state', 'age']]

     location    city governorate  state age
1190   Raoued  Raoued      Ariana    NaN   0

### Hypothesis 2.  if state = 0.0 , possible age = '0' (new)

In [41]:
df[(df['state'] == 0.0) ] [['location', 'city', 'governorate', 'state', 'age']]

               location                 city governorate  state    age
31          El Menzah 9            El Menzah       tunis    0.0  10-20
43           Montfleury                Tunis       tunis    0.0  30-50
74       Mutuelle Ville            El Menzah       tunis    0.0  20-30
103        Bab El Assal                Tunis       tunis    0.0  10-20
118         El Menzah 6         Ariana Ville      Ariana    0.0  20-30
...                 ...                  ...         ...    ...    ...
7968          Ksar Said             Le Bardo       tunis    0.0  20-30
7969          Ksar Said             Le Bardo       tunis    0.0  20-30
8034  Cité Ubn Khaldoun  El Omrane Superieur       tunis    0.0  10-20
8075           Bellevue           El Ouardia       tunis    0.0   5-10
8114        Ksar Hellal                  NaN    Monastir    0.0  30-50

[325 rows x 5 columns]

In [42]:
((df['age'].isnull()) &  (df['state'] == 0.0) ).sum()

0

### Hypothesis 3.  at same neighbour houses would have been same age.
Groupby with location and look age mean

In [44]:
df.groupby(['location'])['age'].count()

location
Abou El Kacem Chebbi     2
Aghir                   11
Ain Zaghouan Nord       78
Ain Zaghouan Sud        14
Ajim                     1
                        ..
Zaouit Mornag            0
Zarzis                   4
Zarzouna                 0
Zone Touristique        11
Zone touristique         1
Name: age, Length: 468, dtype: int64

In [46]:
df.groupby(['state','age'])['location'].value_counts()

state  age          location
0.0    0            Hammamet Nord    2
                    Djerba           1
                    Gammarth         1
                    Hammamet         1
                    Hergla           1
                                    ..
2.0    5-10         El Yasmina       1
                    El Yasminette    1
       Plus de 100  Djerba           1
                    El Yasminette    1
                    Kélibia          1
Name: count, Length: 1292, dtype: int64

In [47]:
df.groupby(['location']).price_eur.mean()

location
Abou El Kacem Chebbi    209766.666667
Aghir                   230104.545455
Ain Zaghouan Nord       153048.550000
Ain Zaghouan Sud        101567.272727
Ajim                    162750.000000
                            ...
Zaouit Mornag                     NaN
Zarzis                  216896.666667
Zarzouna                 99200.000000
Zone Touristique        154985.238095
Zone touristique        148025.000000
Name: price_eur, Length: 468, dtype: float64

In [48]:
df.groupby(['city']).price_eur.mean()

city
Ajim            162750.000000
Akouda          166632.881356
Ariana Ville    188472.411795
Ben Arous       105128.750000
Beni Khiar      144260.714286
                    ...
Sousse Riadh    187311.538462
Sousse Ville    153474.227500
Tabarka          91671.428571
Tebourba        155000.000000
Tunis           176726.456164
Name: price_eur, Length: 70, dtype: float64

In [49]:
df.groupby(['governorate'])[['location', 'city', 'governorate', 'state', 'age']]

In [50]:
df[df['governorate'] == 'Djerba'][['location', 'city', 'governorate', 'state', 'age']]

        location    city governorate  state   age
7         Midoun     NaN      Djerba    NaN   NaN
19      Tezdaine     NaN      Djerba    1.0  5-10
23        Midoun     NaN      Djerba    NaN   NaN
24         Aghir     NaN      Djerba    2.0   1-5
25        Midoun     NaN      Djerba    NaN   NaN
...          ...     ...         ...    ...   ...
7721      Djerba  Djerba      Djerba    2.0     0
7927      Djerba  Djerba      Djerba    2.0     0
8084  Houmt Souk  Djerba      Djerba    NaN   NaN
8093      Djerba     NaN      Djerba    NaN   NaN
8111      Djerba  Djerba      Djerba    1.0   NaN

[384 rows x 5 columns]

In [51]:
df['age'].value_counts(dropna = False)

age
NaN            4145
0              1471
1-5             826
10-20           681
5-10            671
20-30           193
30-50           104
50-70            22
Plus de 100       9
70-100            7
Name: count, dtype: int64

In [52]:
df.groupby('age')['state'].value_counts(dropna = False)

age          state
0            2.0      1319
             1.0       142
             0.0         9
             NaN         1
1-5          2.0       411
             1.0       403
             0.0        12
10-20        1.0       487
             0.0       176
             2.0        18
20-30        1.0       126
             0.0        58
             2.0         9
30-50        1.0        61
             0.0        41
             2.0         2
5-10         1.0       546
             2.0       109
             0.0        16
50-70        1.0        15
             0.0         7
70-100       0.0         5
             1.0         2
Plus de 100  1.0         5
             2.0         3
             0.0         1
Name: count, dtype: int64

In [53]:
((df['age'].isnull()) & (df['state'].isnull())).sum()

1099

In [54]:
(df['age'] == '0').sum()

1471

In [55]:
1319/(df['age'] == '0').sum() *100

89.66689326988443

In [56]:
((df['age'].isnull()) | (df['state'].isnull())).sum()

4146

In [57]:
df['state'].value_counts(dropna = False)

state
1.0    3660
2.0    3044
NaN    1100
0.0     325
Name: count, dtype: int64

In [58]:
df.groupby('state')['age'].value_counts(dropna = False)

state  age
0.0    10-20           176
       20-30            58
       30-50            41
       5-10             16
       1-5              12
       0                 9
       50-70             7
       70-100            5
       Plus de 100       1
1.0    NaN            1873
       5-10            546
       10-20           487
       1-5             403
       0               142
       20-30           126
       30-50            61
       50-70            15
       Plus de 100       5
       70-100            2
2.0    0              1319
       NaN            1173
       1-5             411
       5-10            109
       10-20            18
       20-30             9
       Plus de 100       3
       30-50             2
Name: count, dtype: int64

In [59]:
df.groupby(['location']).price_eur.mean().round(2)

location
Abou El Kacem Chebbi    209766.67
Aghir                   230104.55
Ain Zaghouan Nord       153048.55
Ain Zaghouan Sud        101567.27
Ajim                    162750.00
                          ...
Zaouit Mornag                 NaN
Zarzis                  216896.67
Zarzouna                 99200.00
Zone Touristique        154985.24
Zone touristique        148025.00
Name: price_eur, Length: 468, dtype: float64

In [108]:
df.groupby(['location'])['age'].value_counts()

location              age
Abou El Kacem Chebbi  0        1
                      10-20    1
Aghir                 0        4
                      5-10     3
                      10-20    2
                              ..
Zone Touristique      1-5      1
                      10-20    1
                      20-30    1
                      5-10     1
Zone touristique      1-5      1
Name: count, Length: 1010, dtype: int64

In [104]:
df.groupby(['location'])['age'].value_counts().agg(['max', 'min'])

max    101
min      1
Name: count, dtype: int64

                            id  price_tnd  price_eur  city  governorate  Area
location             age
Abou El Kacem Chebbi 0       1          0          0     1            1     1  \
                     10-20   1          1          1     1            1     1
Aghir                0       4          3          3     1            4     4
                     1-5     2          2          2     0            2     2
                     10-20   2          2          2     0            2     2
...                         ..        ...        ...   ...          ...   ...
Zone Touristique     1-5     1          1          1     1            1     1
                     10-20   1          1          1     1            1     1
                     20-30   1          1          1     1            1     1
                     5-10    1          1          1     1            1     1
Zone touristique     1-5     1          0          0     1            1     1

                            pieces  room  bathroom  state  ...  garden
location             age                                   ...
Abou El Kacem Chebbi 0           1     1         1      1  ...       1  \
                     10-20       1     1         1      1  ...       1
Aghir                0           2     4         4      4  ...       4
                     1-5         2     2         2      2  ...       2
                     10-20       2     2         2      2  ...       2
...                            ...   ...       ...    ...  ...     ...
Zone Touristique     1-5         1     1         1      1  ...       1
                     10-20       1     1         1      1  ...       1
                     20-30       1     1         1      1  ...       1
                     5-10        1     1         1      1  ...       1
Zone touristique     1-5         1     1         1      1  ...       1

                            concierge  beach_view  mountain_view  pool
location             age
Abou El Kacem Chebbi 0              1           1              1     1  \
                     10-20          1           1              1     1
Aghir                0              4           4              4     4
                     1-5            2           2              2     2
                     10-20          2           2              2     2
...                               ...         ...            ...   ...
Zone Touristique     1-5            1           1              1     1
                     10-20          1           1              1     1
                     20-30          1           1              1     1
                     5-10           1           1              1     1
Zone touristique     1-5            1           1              1     1

                            elevator  furnished  equipped_kitchen
location             age
Abou El Kacem Chebbi 0             1          1                 1  \
                     10-20         1          1                 1
Aghir                0             4          4                 4
                     1-5           2          2                 2
                     10-20         2          2                 2
...                              ...        ...               ...
Zone Touristique     1-5           1          1                 1
                     10-20         1          1                 1
                     20-30         1          1                 1
                     5-10          1          1                 1
Zone touristique     1-5           1          1                 1

                            central_heating  air_conditioning
location             age
Abou El Kacem Chebbi 0                    1                 1
                     10-20                1                 1
Aghir                0                    4                 4
                     1-5                  2                 2
                     10-20                2                 2
...                                     ...               ...
Zone Touristique     1-5                  1                 1
                     10-20                1                 1
                     20-30                1                 1
                     5-10                 1                 1
Zone touristique     1-5                  1                 1

[1010 rows x 24 columns]

In [11]:
df.groupby(['state'])['age'].agg(pd.Series.mode)

state
0.0    10-20
1.0     5-10
2.0        0
Name: age, dtype: object

In [23]:
df.groupby(['age'])['state'].apply(pd.Series.mode)

age
0            0    2.0
1-5          0    2.0
10-20        0    1.0
20-30        0    1.0
30-50        0    1.0
5-10         0    1.0
50-70        0    1.0
70-100       0    0.0
Plus de 100  0    1.0
Name: state, dtype: float64

In [20]:
df.groupby(['age'])['state'].agg([pd.Series.mode, min, max, np.median, np.mean, pd.Series.count])

             mode  min  max  median      mean  count
age
0             2.0  0.0  2.0     2.0  1.891156   1470
1-5           2.0  0.0  2.0     1.0  1.483051    826
10-20         1.0  0.0  2.0     1.0  0.767988    681
20-30         1.0  0.0  2.0     1.0  0.746114    193
30-50         1.0  0.0  2.0     1.0  0.625000    104
5-10          1.0  0.0  2.0     1.0  1.138599    671
50-70         1.0  0.0  1.0     1.0  0.681818     22
70-100        0.0  0.0  1.0     0.0  0.285714      7
Plus de 100   1.0  0.0  2.0     1.0  1.222222      9

In [21]:
df.groupby(['age', 'state'])['state'].agg([pd.Series.mode, min, max, np.median, np.mean, pd.Series.count])

                   mode  min  max  median  mean  count
age         state
0           0.0     0.0  0.0  0.0     0.0   0.0      9
            1.0     1.0  1.0  1.0     1.0   1.0    142
            2.0     2.0  2.0  2.0     2.0   2.0   1319
1-5         0.0     0.0  0.0  0.0     0.0   0.0     12
            1.0     1.0  1.0  1.0     1.0   1.0    403
            2.0     2.0  2.0  2.0     2.0   2.0    411
10-20       0.0     0.0  0.0  0.0     0.0   0.0    176
            1.0     1.0  1.0  1.0     1.0   1.0    487
            2.0     2.0  2.0  2.0     2.0   2.0     18
20-30       0.0     0.0  0.0  0.0     0.0   0.0     58
            1.0     1.0  1.0  1.0     1.0   1.0    126
            2.0     2.0  2.0  2.0     2.0   2.0      9
30-50       0.0     0.0  0.0  0.0     0.0   0.0     41
            1.0     1.0  1.0  1.0     1.0   1.0     61
            2.0     2.0  2.0  2.0     2.0   2.0      2
5-10        0.0     0.0  0.0  0.0     0.0   0.0     16
            1.0     1.0  1.0  1.0     1.0   1.0    546
            2.0     2.0  2.0  2.0     2.0   2.0    109
50-70       0.0     0.0  0.0  0.0     0.0   0.0      7
            1.0     1.0  1.0  1.0     1.0   1.0     15
70-100      0.0     0.0  0.0  0.0     0.0   0.0      5
            1.0     1.0  1.0  1.0     1.0   1.0      2
Plus de 100 0.0     0.0  0.0  0.0     0.0   0.0      1
            1.0     1.0  1.0  1.0     1.0   1.0      5
            2.0     2.0  2.0  2.0     2.0   2.0      3